### Importing the Packages

In [1]:
import pandas as pd
import numpy as np

### Importing the data

In [3]:
raw_csv_data = pd.read_csv("Index2018.csv") 
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [4]:
# The top is arbitrary chosen, as all the date value are the same at 1, so it's randomly chosen which to display
df_comp.date.describe()

count           6269
unique          6269
top       12/07/1996
freq               1
Name: date, dtype: object

In [5]:
df_comp

            date          spx       dax         ftse    nikkei
0     07/01/1994   469.900000   2224.95  3445.980000  18124.01
1     10/01/1994   475.270000   2225.00  3440.580000  18443.44
2     11/01/1994   474.130000   2228.10  3413.770000  18485.25
3     12/01/1994   474.170000   2182.06  3372.020000  18793.88
4     13/01/1994   472.470000   2142.37  3360.010000  18577.26
...          ...          ...       ...          ...       ...
6264  23/01/2018  2839.130362  13559.60  7731.827774  24124.15
6265  24/01/2018  2837.544008  13414.74  7643.428966  23940.78
6266  25/01/2018  2839.253031  13298.36  7615.839954  23669.49
6267  26/01/2018  2872.867839  13340.17  7665.541292  23631.88
6268  29/01/2018  2853.528411  13324.48  7671.533300  23629.34

[6269 rows x 5 columns]

### From Text to Date

In [6]:
df_comp['date'] = pd.to_datetime(df_comp['date'], dayfirst=True)

In [7]:
pd.to_datetime(df_comp['date'], format='%d/%m/%Y')[0]

Timestamp('1994-01-07 00:00:00')

In [ ]:
from datetime import datetime as dt
dt.strptime(df_comp["date"][0], '%d/%m/%Y')

### Setting the Index

In [9]:
df_comp.set_index('date', inplace=True)

In [10]:
df_comp.index[0].dayofweek

4

In [11]:
df_comp.index[0].weekday()

4

In [12]:
print(df_comp.index[0].month)
print(df_comp.index[0].day)
print(df_comp.index[0].year)

1
7
1994

### Setting the Desired Frequency

In [13]:
# 'h' hourly, 'w' weekly, 'd' daily, 'm' monthly, 'a' annually, 'b' business day
df_comp = df_comp.asfreq('b')

In [14]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

### Handling Missing Values

In [15]:
df_comp.isna()

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [16]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

#### front filing: filing the missing value with the previous date of input
#### back filing: filing the value of the next period
#### filing the same value: for example, filing the average of the data in the column, usually a bad idea in time series

In [17]:
df_comp['spx'] = df_comp['spx'].fillna(method = 'ffill')

In [18]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [19]:
df_comp['ftse'] = df_comp['ftse'].fillna(method = 'bfill')

In [21]:
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [22]:
df_comp.dax = df_comp.dax.fillna(value=df_comp.dax.mean())

In [23]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

### Simplifying the Dataset

In [24]:
df_comp['market value'] = df_comp.dax

In [25]:
df_comp.describe()

               spx           dax         ftse        nikkei  market value
count  6277.000000   6277.000000  6277.000000   6269.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398  14597.055700   6080.063363
std     487.868210   2752.604984  1145.568370   4043.122953   2752.604984
min     438.920000   1911.700000  2876.600000   7054.980000   1911.700000
25%     992.715221   4070.460000  4487.880000  10709.290000   4070.460000
50%    1233.761241   5774.380000  5663.300000  15028.170000   5774.380000
75%    1460.250000   7442.660000  6304.630175  17860.470000   7442.660000
max    2872.867839  13559.600000  7778.637689  24124.150000  13559.600000

In [26]:
del df_comp['spx'], df_comp['dax']

In [29]:
df_comp.drop(['ftse', 'nikkei'], axis=1, inplace=True)

In [30]:
df_comp.describe()

       market value
count   6277.000000
mean    6080.063363
std     2752.604984
min     1911.700000
25%     4070.460000
50%     5774.380000
75%     7442.660000
max    13559.600000

### Splitting the Data

In [31]:
size = int(len(df_comp) * 0.8)

In [32]:
df_train = df_comp.iloc[:size]

In [36]:
df_test = df_comp.iloc[size:]

In [37]:
df_train.tail(3)

            market value
date
2013-04-03       7874.75
2013-04-04       7817.39
2013-04-05       7658.75

In [38]:
df_test.head(3)

            market value
date
2013-04-08       7662.64
2013-04-09       7637.51
2013-04-10       7810.63